In [6]:
import pandas as pd
import seaborn as sns

# Importando base de dados

In [7]:
pd.read_csv('dados/tips.csv')

     total_bill   tip dessert   day    time  size
0         16.99  1.01      No   Sun  Dinner     2
1         10.34  1.66      No   Sun  Dinner     3
2         21.01  3.50      No   Sun  Dinner     3
3         23.68  3.31      No   Sun  Dinner     2
4         24.59  3.61      No   Sun  Dinner     4
..          ...   ...     ...   ...     ...   ...
239       29.03  5.92      No   Sat  Dinner     3
240       27.18  2.00     Yes   Sat  Dinner     2
241       22.67  2.00     Yes   Sat  Dinner     2
242       17.82  1.75      No   Sat  Dinner     2
243       18.78  3.00      No  Thur  Dinner     2

[244 rows x 6 columns]

In [8]:
dados = pd.read_csv('dados/tips.csv')

In [9]:
dados.head(10)

   total_bill   tip dessert  day    time  size
0       16.99  1.01      No  Sun  Dinner     2
1       10.34  1.66      No  Sun  Dinner     3
2       21.01  3.50      No  Sun  Dinner     3
3       23.68  3.31      No  Sun  Dinner     2
4       24.59  3.61      No  Sun  Dinner     4
5       25.29  4.71      No  Sun  Dinner     4
6        8.77  2.00      No  Sun  Dinner     2
7       26.88  3.12      No  Sun  Dinner     4
8       15.04  1.96      No  Sun  Dinner     2
9       14.78  3.23      No  Sun  Dinner     2

## TraduÃ§Ã£o

In [10]:
dados.columns

Index(['total_bill', 'tip', 'dessert', 'day', 'time', 'size'], dtype='object')

In [11]:
renomear = {
    'total_bill' : 'valor_da_conta',
    'tip' : 'gorjeta',
    'dessert' : 'sobremesa',
    'day' : 'dia_da_semana',
    'time' : 'hora_do_dia',
    'size' : 'total_de_pessoas'
}

In [12]:
type(dados)

pandas.core.frame.DataFrame

In [14]:
gorjetas = dados.rename(columns = renomear)

In [16]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,No,Sun,Dinner,2

In [17]:
gorjetas.sobremesa.unique()

array(['No', 'Yes'], dtype=object)

In [18]:
sim_nao = {
    'No' : 'NÃ£o',
    'Yes' : 'Sim'
}

In [19]:
gorjetas.sobremesa.map(sim_nao)

0      NÃ£o
1      NÃ£o
2      NÃ£o
3      NÃ£o
4      NÃ£o
      ...
239    NÃ£o
240    Sim
241    Sim
242    NÃ£o
243    NÃ£o
Name: sobremesa, Length: 244, dtype: object

In [20]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,No,Sun,Dinner,2

In [23]:
gorjetas.sobremesa = gorjetas.sobremesa.map(sim_nao)

In [24]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,NÃ£o,Sun,Dinner,2

In [25]:
gorjetas.dia_da_semana.unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [26]:
dias = {
    'Sun' : 'Domingo',
    'Sat' : 'SÃ¡bado',
    'Thur' : 'Quinta',
    'Fri' : 'Sexta'
}

In [28]:
gorjetas.dia_da_semana = gorjetas.dia_da_semana.map(dias)

In [29]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,NÃ£o,Domingo,Dinner,2

In [30]:
gorjetas.dia_da_semana.unique()

array(['Domingo', 'SÃ¡bado', 'Quinta', 'Sexta'], dtype=object)

In [31]:
gorjetas.hora_do_dia.unique()

array(['Dinner', 'Lunch'], dtype=object)

In [32]:
hora = {
    'Dinner' : 'Jantar', 
    'Lunch' : 'AlmoÃ§o'
}

In [33]:
gorjetas.hora_do_dia = gorjetas.hora_do_dia.map(hora)

In [34]:
gorjetas.head(1)

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
0,16.99,1.01,NÃ£o,Domingo,Jantar,2

In [38]:
gorjetas.tail() # exibe os Ãºltimos cinco itens do DataFrame

,valor_da_conta,gorjeta,sobremesa,dia_da_semana,hora_do_dia,total_de_pessoas
239,29.03,5.92,NÃ£o,SÃ¡bado,Jantar,3
240,27.18,2.00,Sim,SÃ¡bado,Jantar,2
241,22.67,2.00,Sim,SÃ¡bado,Jantar,2
242,17.82,1.75,NÃ£o,SÃ¡bado,Jantar,2
243,18.78,3.00,NÃ£o,Quinta,Jantar,2

In [ ]:
# Deletar uma coluna do DataFrame = tips.drop('day', axis=1)